Tekla.Structures.ModelInternal.Dstv.DstvContourRow
The information about a dstv contour point.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.#ctor
Creates a new DstvContourRow instance.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.DstvView
The dstv view type: front, top, back or below

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.Position
The dstv contour point position.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.NotchType
The notch type.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.Radius
The radius.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.WeldPrepTop
The top weld preparation information.

Tekla.Structures.ModelInternal.Dstv.DstvContourRow.WeldPrepBottom
The bottom weld preparation information.